DataProcessors/ИзменениеНастроекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ИзменениеНастроекУчета</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТаблицаРолиИИсполнители</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РолиИИсполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/РолиИИсполнители.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>РолиИИсполнители</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ИзменениеНастроекУчета/Ext/ObjectModule.bsl
Перем мМаксимальныйРазмерНабораЗаписей Экспорт;

#Если Клиент Тогда
	
// Функция для проверки возможности изменения настроек учета - открытия соответствующих форм для редактирования
//
Функция ПолучитьРазрешениеНаИзменениеНастроекУчета() Экспорт
	
	Если РольДоступна("ПолныеПрава") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Предупреждение("Изменение настроек может выполнять только пользователь с ролью ""Полные права""");
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьПодтверждениеПользователя(ЗаголовокВопроса="") Экспорт
	ТекстВопроса = 
	"Выполнение данной операции может занять продолжительное время. 
	|Настоятельно рекомендуется предварительно ознакомиться cо справочной информацией. Продолжить?";
	Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,ЗаголовокВопроса) = КодВозвратаДиалога.Нет Тогда
		Возврат ложь;
	КонецЕсли;
    Возврат истина;
КонецФункции

Процедура ДобавитьРаздел(СписокРазделов, ИмяРаздела, Представление, УровеньРаздела = 1) Экспорт

	Отступ = "";
	Для Сч2 = 1 По УровеньРаздела - 1 Цикл
		Отступ = Отступ + "    ";
	КонецЦикла; 
	
	СтрокаРаздела = СписокРазделов.Добавить();
	СтрокаРаздела.ИмяРаздела = ИмяРаздела;
	СтрокаРаздела.Представление = " " + Отступ + Представление;
	
КонецПроцедуры // ДобавитьРаздел

Функция ПолучитьСтруктуруЗначенийПараметров()
	
	СтруктураЗначенийПараметров = Новый Структура;
	
	// Получим константы
	ТекстЗапроса = "";
	Для каждого ЭлКонстанта Из Метаданные.Константы Цикл
		
		ПолучитьПредставлениеЗначения = Ложь;
		Для каждого ЭлКоллекции Из ЭлКонстанта.Тип.Типы() Цикл
			// Если не примитивный тип, то необходимо получить представление
			Если ЭлКоллекции <> Тип("Строка")
				И ЭлКоллекции <> Тип("Число")
				И ЭлКоллекции <> Тип("Дата")
				И ЭлКоллекции <> Тип("Булево")
				И ЭлКоллекции <> Тип("ХранилищеЗначения") Тогда
				
				ПолучитьПредставлениеЗначения = Истина;	
			КонецЕсли;				
		КонецЦикла;
		
		Если ПравоДоступа("Чтение", ЭлКонстанта) Тогда
			
			ТекстЗапроса = ТекстЗапроса + ", Константы." + ЭлКонстанта.Имя + " КАК " + ЭлКонстанта.Имя + Символы.ПС;
			Если ПолучитьПредставлениеЗначения Тогда
				ТекстЗапроса = ТекстЗапроса + ", ПРЕДСТАВЛЕНИЕ(Константы." + ЭлКонстанта.Имя + ") КАК " + ЭлКонстанта.Имя + "Представление" + Символы.ПС;
			КонецЕсли;
			
			
			
		Иначе
			
			ТекстЗапроса = ТекстЗапроса + ", ""<Недостаточно прав>"" КАК " + ЭлКонстанта.Имя + Символы.ПС;
			Если ПолучитьПредставлениеЗначения Тогда
				ТекстЗапроса = ТекстЗапроса + ", ""<Недостаточно прав>"" КАК " + ЭлКонстанта.Имя + "Представление" + Символы.ПС;
			КонецЕсли;
			
		КонецЕсли; 
		
		СтруктураЗначенийПараметров.Вставить(ЭлКонстанта.Имя);
		Если ПолучитьПредставлениеЗначения Тогда
			СтруктураЗначенийПараметров.Вставить(ЭлКонстанта.Имя + "Представление");
		КонецЕсли;
		
	КонецЦикла; 
	
	ТекстЗапроса = Сред(ТекстЗапроса, 3);
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|" + ТекстЗапроса + "
		|ИЗ Константы КАК Константы";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(СтруктураЗначенийПараметров, Выборка);
	
	// Параметры расчета себестоимости
	СтруктураЗначенийПараметров.Вставить("СреднееОтклонениеСЛУ", "10^-" + СокрЛП(СтруктураЗначенийПараметров.СреднееОтклонениеСЛУ));
	СтруктураЗначенийПараметров.Вставить("РазмерНабораПриЗаписиРегистровУчетаЗатрат",
		?(СтруктураЗначенийПараметров.РазмерНабораПриЗаписиРегистровУчетаЗатрат = мМаксимальныйРазмерНабораЗаписей,
			"Все сразу",
			"Частями по " + СокрЛП(СтруктураЗначенийПараметров.РазмерНабораПриЗаписиРегистровУчетаЗатрат) + " записей"));
	
	
 	// Получим параметр "НомерВерсииКонфигурации"
	СтруктураЗначенийПараметров.Вставить("НомерВерсииКонфигурации", глЗначениеПеременной("НомерВерсииКонфигурации"));
	
	
	Возврат СтруктураЗначенийПараметров;
	
КонецФункции // ПолучитьСтруктуруЗначенийПараметров

Процедура Печать(СписокРазделов, Заголовок) Экспорт
	
	Макет = ПолучитьМакет("ПараметрыПечать");
	ОбластьРазделитель = Макет.ПолучитьОбласть("Разделитель");
	ТабДокумент = Новый ТабличныйДокумент;
	
	СтруктураЗначенийПараметров = ПолучитьСтруктуруЗначенийПараметров();
	
	Для каждого РазделПараметров Из СписокРазделов Цикл
		Если Макет.Области.Найти(РазделПараметров.ИмяРаздела) = Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		
		ОбластьРаздела = Макет.ПолучитьОбласть(РазделПараметров.ИмяРаздела);
		ОбластьРаздела.Параметры.Заполнить(СтруктураЗначенийПараметров);
		
		Если РазделПараметров.ИмяРаздела = "Взаиморасчеты" Тогда
			БУ = ПланыСчетов.Хозрасчетный.КассаВНациональнойВалюте;
			КассыОбособленныхПодразделений = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбособленныеПодразделенияБезОбразованияЮрЛица, "ВидСубконто") = Неопределено, Ложь, Истина);
			ОбластьРаздела.Параметры.КассыОбособленныхПодразделений = КассыОбособленныхПодразделений;
		КонецЕсли; 
		
		ТабДокумент.Вывести(ОбластьРаздела);
		ТабДокумент.Вывести(ОбластьРазделитель);
	КонецЦикла;
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, , Ложь, Заголовок);	
	
КонецПроцедуры // Печать

////////////////////////////////////////////////////////////////////////////////

Процедура ПолучитьОбщиеДанныеИЗаполнитьФорму(ФормаОбработки) Экспорт
	
	Если ФормаОбработки.ЭлементыФормы.ПанельРазделов.Страницы.СтраницаРаботаСЗадачами.Видимость Тогда
		
		//получим список задач
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыЗадачПользователей.Ссылка,
		|	ВидыЗадачПользователей.Использование,
		|	ПРЕДСТАВЛЕНИЕ(ВидыЗадачПользователей.Ссылка) КАК СсылкаПредставление
		|ИЗ
		|	Справочник.ВидыЗадачПользователей КАК ВидыЗадачПользователей
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидыЗадачПользователей.Наименование";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ФормаОбработки.СписокВидовЗадач.Добавить(Выборка.Ссылка, Выборка.СсылкаПредставление, Выборка.Использование);	
		КонецЦикла;	
		
		НаборЗаписей = РегистрыСведений.РолиИИсполнители.СоздатьНаборЗаписей();
		НаборЗаписей.Прочитать();
		ТаблицаРолиИИсполнители = НаборЗаписей.Выгрузить();
		
		// заполним массив мМассивПользователей - пользователи для которых производится настройка работы
		// с задачами, и соответствие пользователей и пользователей ИБ
		ТаблицаПользователейИБ = Новый ТаблицаЗначений;
		ТаблицаПользователейИБ.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(150)));
		ТаблицаПользователейИБ.Колонки.Добавить("РольИсполнителя", Новый ОписаниеТипов("СправочникСсылка.РолиИсполнителей"));
		
		МассивПользователейИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
		Для Каждого ПользовательИБ Из МассивПользователейИБ Цикл
			Для Каждого ЭлементСоответствия Из ФормаОбработки.мСоответствиеРолей Цикл
				ДоступнаяРоль = ЭлементСоответствия.Ключ;
				МассивРольИсполнителя = ЭлементСоответствия.Значение;
				Если ПользовательИБ.Роли.Содержит(ДоступнаяРоль) Тогда
					Для Каждого ЭлементМассива Из МассивРольИсполнителя Цикл
						Строка = ТаблицаПользователейИБ.Добавить();
						Строка.Имя				= ПользовательИБ.Имя;
						Строка.РольИсполнителя	= ЭлементМассива;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТаблицаПользователейИБ", ТаблицаПользователейИБ);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПользователиИБ.Имя КАК Имя,
		|	ПользователиИБ.РольИсполнителя
		|ПОМЕСТИТЬ ПользователиИБ
		|ИЗ
		|	&ТаблицаПользователейИБ КАК ПользователиИБ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Имя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Пользователи.Ссылка,
		|	Пользователи.Код КАК Код,
		|	ПользователиИБ.РольИсполнителя
		|ИЗ
		|	ПользователиИБ КАК ПользователиИБ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО ПользователиИБ.Имя = Пользователи.Код
		|
		|УПОРЯДОЧИТЬ ПО
		|	Код";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.СледующийПоЗначениюПоля("Код") Цикл
			// заполним соответствие пользователями, для которых доступна настройка задач
			МассивРолейИсполнителя = Новый Массив;
			Пока Выборка.Следующий() Цикл
				МассивРолейИсполнителя.Добавить(Выборка.РольИсполнителя);
			КонецЦикла;
			
			Если МассивРолейИсполнителя.Количество()>0 Тогда
				ФормаОбработки.мСоответствиеПользователейИРолей.Вставить(Выборка.Ссылка, МассивРолейИсполнителя);
			КонецЕсли;
		КонецЦикла;
		
		ЗаполнитьТЧРолиИИсполнители(ФормаОбработки);
		
	КонецЕсли;
	
	

КонецПроцедуры

// Процедура заполняет табличную часть РолиИИсполнители
Процедура ЗаполнитьТЧРолиИИсполнители(ФормаОбработки) Экспорт

	МассивОрганизаций = Новый Массив;
	Если ФормаОбработки.РазделятьЗадачиПоОрганизациям Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Организации.Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации";
		МассивОрганизаций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Если Не ФормаОбработки.РазделятьЗадачиПоОрганизациям и Не ФормаОбработки.РазделятьЗадачиПоРолямИсполнителей Тогда
		// нет разделения задач по ролям и организациям
		// не заполняем табличную часть РолиИИсполнители
	ИначеЕсли ФормаОбработки.РазделятьЗадачиПоОрганизациям и Не ФормаОбработки.РазделятьЗадачиПоРолямИсполнителей Тогда
		// задачи разделяются только по организациям
		СтруктураПоиска = Новый Структура("Исполнитель, Организация, Роль");
		СтруктураПоиска.Вставить("Роль", Справочники.РолиИсполнителей.ПустаяСсылка());
		Для Каждого ЭлементСоответствия Из ФормаОбработки.мСоответствиеПользователейИРолей Цикл
			Пользователь = ЭлементСоответствия.Ключ;
			СтруктураПоиска.Вставить("Исполнитель", Пользователь);
			Для Каждого Организация Из МассивОрганизаций Цикл
				СтруктураПоиска.Вставить("Организация", Организация);
				Если РолиИИсполнители.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
					НоваяСтрока = РолиИИсполнители.Добавить();
					НоваяСтрока.Исполнитель = Пользователь;
					НоваяСтрока.Организация = Организация;
					НоваяСтрока.Роль = Справочники.РолиИсполнителей.ПустаяСсылка();
					НоваяСтрока.Использование = ТаблицаРолиИИсполнители.НайтиСтроки(СтруктураПоиска).Количество() > 0;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
	Иначе // задачи разделяются по ролям
		
		СтруктураПоиска = Новый Структура("Исполнитель, Организация, Роль");
		
		Для Каждого ЭлементСоответствия Из ФормаОбработки.мСоответствиеПользователейИРолей Цикл
			
			Пользователь = ЭлементСоответствия.Ключ;
			МассивРолиИсполнителя = ЭлементСоответствия.Значение;
			СтруктураПоиска.Вставить("Исполнитель", Пользователь);
			
			Для каждого РольИсполнителя Из МассивРолиИсполнителя Цикл
				СтруктураПоиска.Вставить("Роль", РольИсполнителя);
				Если ФормаОбработки.РазделятьЗадачиПоОрганизациям Тогда
					Для Каждого Организация Из МассивОрганизаций Цикл
						СтруктураПоиска.Вставить("Организация", Организация);
						Если РолиИИсполнители.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
							НоваяСтрока = РолиИИсполнители.Добавить();
							НоваяСтрока.Исполнитель = Пользователь;
							НоваяСтрока.Роль = РольИсполнителя;
							НоваяСтрока.Организация = Организация;
							НоваяСтрока.Использование = ТаблицаРолиИИсполнители.НайтиСтроки(СтруктураПоиска).Количество() > 0;
						КонецЕсли;
					КонецЦикла;
				Иначе
					СтруктураПоиска.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
					Если РолиИИсполнители.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
						НоваяСтрока = РолиИИсполнители.Добавить();
						НоваяСтрока.Исполнитель = Пользователь;
						НоваяСтрока.Роль = РольИсполнителя;
						НоваяСтрока.Организация = Справочники.Организации.ПустаяСсылка();
						НоваяСтрока.Использование = ТаблицаРолиИИсполнители.НайтиСтроки(СтруктураПоиска).Количество() > 0;
					КонецЕсли;
					
				КонецЕсли;	
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	РолиИИсполнители.Сортировать("Исполнитель, Организация, Роль");
	
КонецПроцедуры

Процедура ОткрытьФормуНастройкиРолей(ФормаОбработки, КлючУникальности) Экспорт

	Форма = ПолучитьФорму("НастройкаРолейИсполнителей", ФормаОбработки, КлючУникальности);
	Форма.РазделятьЗадачиПоОрганизациям = ФормаОбработки.РазделятьЗадачиПоОрганизациям;    
	Форма.РазделятьЗадачиПоРолямИсполнителей = ФормаОбработки.РазделятьЗадачиПоРолямИсполнителей;
	Форма.Заголовок = "Настройка списка задач пользователей" ;
	Форма.ОткрытьМодально();

КонецПроцедуры



#КонецЕсли

мМаксимальныйРазмерНабораЗаписей = 999999999;
